# -*- coding: utf-8 -*-

# (цикл while)

# даны целые положительные числа a и b (a > b)
# Определить результат целочисленного деления a на b, с помощью цикла while,
# __НЕ__ используя стандартную операцию целочисленного деления (// и %)
# Формат вывода:
#   Целочисленное деление ХХХ на YYY дает ZZZ

a, b = 179, 37


# TODO здесь ваш код
=======
c = 0
n = 3
while c < n:
    print('Целочисленное деление',a,'на',b,'дает',round(a/b))
    c += 1
# выводит 4.8, округлил до 5





